# Знакомство с языком Python (семинары)
# Урок 3. Списки и словари
# https://gb.ru/lessons/391154


# 00:39:35

""" Задача №17. Общее обсуждение 

Дан список чисел. Определите, сколько в нем встречается различных чисел. """

# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

""" Примечание: Пользователь может вводить значения
списка или список задан изначально. """


""" Задача №19. Решение в группах """

""" Дана последовательность из N целых чисел и число K. 
Необходимо сдвинуть всю последовательность
(сдвиг - циклический) на K элементов вправо, 
K – положительное число. """

# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]

""" Примечание: Пользователь может вводить значения
списка или список задан изначально. """

